<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>
    Downloads the latest Cisco Webex Meetings disk image and creates a versioned package.
  </string>
  <key>Identifier</key>
  <string>com.github.sincerelyjoshin.pkg.WebexMeetings</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>WebexMeetings</string>
  </dict>
  <key>ParentRecipe</key>
  <string>com.github.sincerelyjoshin.download.WebexMeetings</string>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>PkgCopier</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        <key>source_pkg</key>
        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Cisco Webex Meetings.pkg</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
