<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>
    Downloads the latest OHSecureBrowser disk image and creates a versioned package.
  </string>
  <key>Identifier</key>
  <string>com.github.sincerelyjoshin.pkg.OHSecureBrowser</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>OHSecureBrowser</string>
    <key>SCRIPTS</key>
    <string></string>
  </dict>
  <key>ParentRecipe</key>
  <string>com.github.sincerelyjoshin.download.OHSecureBrowser</string>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>Process</key>
  <array>
    <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
            <key>pkg_request</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>version</key>
                <string>%version%</string>
                <key>id</key>
                <string>%bundleid%</string>
                <key>options</key>
                <string>purge_ds_store</string>
                <key>scripts</key>
                <string>%SCRIPTS%</string>
                <key>chown</key>
                <array>
                    <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
