<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of Audacity.</string>
    <key>Identifier</key>
    <string>com.github.sincerelyjoshin-recipes.pkg.Audacity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Audacity</string>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
        <key>SCRIPTS</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.sincerelyjoshin-recipes.download.Audacity</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/Audacity.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>