<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Google Drive File Stream and builds a pkg.</string>
    <key>Identifier</key>
    <string>com.github.sincerelyjoshin.pkg.GoogleDriveFileStream</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleDriveFileStream</string>
        <key>SCRIPTS</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.GoogleDriveFileStream</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/GoogleDriveFileStream.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/GoogleDriveFileStream.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Google Drive File Stream.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Google Drive File Stream.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Google Drive File Stream.app</string>
            </dict>
        </dict>
        <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
            <key>pkg_request</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>version</key>
                <string>%version%</string>
                <key>id</key>
                <string>%bundleid%</string>
                <key>options</key>
                <string>purge_ds_store</string>
                <key>scripts</key>
                <string>%SCRIPTS%</string>
                <key>chown</key>
                <array>
                    <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </dict>
    </array>
</dict>
</plist>
