<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>
    Downloads the prerelease LEGO Mindstorms Education EV3 Classroom disk image.
  </string>
  <key>Identifier</key>
  <string>com.github.sincerelyjoshin.download.EV3Classroom</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>EV3Classroom</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://go.api.education.lego.com/v1/lms-scratch-edu</string>
        <key>filename</key>
        <string>%NAME%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/EV3 Classroom.app</string>
        <key>expected_authority_names</key>
        <array>
          <string>Developer ID Application: LEGO System AS (RS3Y27K2T9)</string>
          <string>Developer ID Certification Authority</string>
          <string>Apple Root CA</string>
        </array>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Versioner</string>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/EV3 Classroom.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
