<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest version of VEXcode IQ.</string>
	<key>Identifier</key>
	<string>com.github.sincerelyjoshin.pkg.VEXcodeIQ</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VEXcode IQ</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.sincerelyjoshin.download.VEXcodeIQ</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
      <key>Arguments</key>
      <dict>
        <key>source_pkg</key>
        <string>%pathname%/VEXcode IQ.pkg</string>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
      </dict>
		</dict>
	</array>
</dict>
</plist>
